<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"827c31ea24061e285c02ac2fee1b44377202102e61cd3525a7ebff486413d9f5","plan_job_ref":"Job .github/workflows/_test-tf.yaml #114 at https://github.com/DND-IT/github-workflows/actions/runs/16826393004","plan_out_hash":"75c1dab8215f218de4d3f2bbed9c1781effd849b3ec814331b3246191accc6a3","plan_hash":"13385a61b5c417458b0576db36b4853a9455ba3016ac67eccf0c23c2ded1290b","plan_text_format":"diff","version":"2.2.1"} -->
Terraform plan in __tests/terraform/s3__
With backend config: `bucket=tf-state-911453050078
key=sandbox1.tfstate
workspace_key_prefix=github-workflows
`
With var files: `tests/terraform/s3/environment/sandbox.tfvars`
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.this will be created
+   resource "random_id" "this" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 4
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

  # random_pet.this will be created
+   resource "random_pet" "this" {
+       id        = (known after apply)
+       length    = 2
+       separator = "-"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   random_id  = (known after apply)
+   random_pet = (known after apply)
```
</details>

:memo: Plan generated in [.github/workflows/_test-tf.yaml #114](https://github.com/DND-IT/github-workflows/actions/runs/16826393004)